package com.example.happynewyear2026;

import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.app.AppCompatDelegate;
import androidx.core.content.ContextCompat;

import android.os.Bundle;
import android.text.Layout;
import android.text.Spannable;
import android.text.SpannableString;
import android.text.style.AlignmentSpan;
import android.text.style.ForegroundColorSpan;
import android.text.style.RelativeSizeSpan;
import android.view.View;
import android.view.Window;
import android.view.WindowManager;
import android.widget.TextView;

public class CongratsActivity extends AppCompatActivity {

    private TextView congrats;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        getWindow().setFlags(
                WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS,
                WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS
        );
        AppCompatDelegate.setDefaultNightMode(AppCompatDelegate.MODE_NIGHT_NO);
        supportRequestWindowFeature(Window.FEATURE_NO_TITLE);
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_congrats);

        FlameRectangleView flameRectangleView = findViewById(R.id.background_FRV);
        flameRectangleView.setColors(
                ContextCompat.getColor(this, R.color.dirty_white),
                ContextCompat.getColor(this, R.color.light_gray)
        );
        flameRectangleView.setSecondaryRectSideFactor(0.01f);
        flameRectangleView.setSecondaryRectSpeed(0f);

        HorseAnimationView bottom = findViewById(R.id.bottom_HAV);
        bottom.stopAnimation();

        congrats = findViewById(R.id.congrats_TV);
        setCongratulation();
    }

    public void nextPoem(View view) {
        setCongratulation();
    }

    private void setCongratulation() {
        String mainCongrats1 = "Вот опять пришло время подводить итоги уходящего года. На этот раз - 2025-го... " +
                "Как и любой другой год, этот оставил на каждом из нас след. Где-то этот след лёгкий, почти невесомый, " +
                "а где-то - глубокий и значимый. Местами он мог быть тёмным: моменты, которые хотелось бы навсегда забыть; " +
                "испытания, забиравшие все моральные и физические силы; люди, которые могли мешать и сбивать с пути. " +
                "Однако есть и светлые следы: моменты истинного счастья, навсегда запечатлённые в памяти; успехи и " +
                "достижения, которые заставляют гордиться и дают силы на новые свершения; люди, которые помогали " +
                "справиться с проблемами и поддерживали в нужный момент. Какой след человеку важнее? Зависит от него " +
                "самого. Только нам решать, на какой цвет обращать внимание и какой цвет будет перекрывать другой.\n\n" +
                "Я верю, что в наших силах в новом году создать такую палитру, где светлых цветов станет больше. " +
                "А тёмные цвета не испортят картину, а лишь добавят ей глубины и контраста, " +
                "напоминая о том, через что мы прошли и чему научились.\n\n" +
                "Пусть 2026-й год станет полотном, на котором вы сами нарисуете свою историю. Историю " +
                "с новыми событиями и возможностями, с маленькими ежедневными радостями и большими, долгожданными " +
                "победами. Желаю, чтобы холст нового года не пустовал, а заполнялся именно теми красками, " +
                "которые вы хотите видеть. И пусть все нынешние тревоги и сомнения останутся в прошлом, " +
                "уступив место уверенности, спокойствию и вере в лучшее.\n\n" +
                "И на этой ноте я хочу...\n\n",
                mainCongrats2 = "\n\nИ, как обычно, завершаю свою речь весёлым новогодним стишком =D\n\n\n\n";

        String poem = poems[(int) (Math.random() * poems.length)];
        Spannable part1 = new SpannableString(mainCongrats1.replace(" ", "  ")),
                part2 = new SpannableString("ПОЗДРАВИТЬ ВАС\nС НАСТУПАЮЩИМ 2026-М ГОДОМ!".replace(" ", "  ")),
                part3 = new SpannableString(mainCongrats2.replace(" ", "  ")),
                part4 = new SpannableString(poem.replace(" ", "  "));

        part1.setSpan(new ForegroundColorSpan(ContextCompat.getColor(this, R.color.black)), 0, part1.length(), Spannable.SPAN_EXCLUSIVE_EXCLUSIVE);
        part2.setSpan(new ForegroundColorSpan(ContextCompat.getColor(this, R.color.primary)), 0, part2.length(), Spannable.SPAN_EXCLUSIVE_EXCLUSIVE);
        part2.setSpan(new AlignmentSpan.Standard(Layout.Alignment.ALIGN_CENTER), 0, part2.length(), Spannable.SPAN_EXCLUSIVE_EXCLUSIVE);
        part2.setSpan(new RelativeSizeSpan(1.5f), 0, part2.length(), Spannable.SPAN_EXCLUSIVE_EXCLUSIVE);
        part3.setSpan(new ForegroundColorSpan(ContextCompat.getColor(this, R.color.black)), 0, part3.length(), Spannable.SPAN_EXCLUSIVE_EXCLUSIVE);
        part4.setSpan(new ForegroundColorSpan(ContextCompat.getColor(this, R.color.blood_red)), 0, part4.length(), Spannable.SPAN_EXCLUSIVE_EXCLUSIVE);

        congrats.setText(part1);
        congrats.append(part2);
        congrats.append(part3);
        congrats.append(part4);
    }

    private final String[] poems = {
            "Счастье, радость и веселье\n" + // БЫЛО; ПРОВ.
                    "Пусть подарит Новый год!\n" +
                    "И удачи пусть под ёлку\n" +
                    "Вам побольше принесёт.\n" +
                    "\n" +
                    "Пусть положит под подушку\n" +
                    "Пуд тепла и доброты,\n" +
                    "А в ладошке тихо спрячет\n" +
                    "Исполнение мечты.\n" +
                    "\n" +
                    "Из любви и вдохновенья\n" +
                    "Пусть сплетёт простой венок\n" +
                    "И завяжет тихо-тихо\n" +
                    "Вам на счастье узелок.",
            "Вот приходит Новый год\n" + // ПРОВ.
                    "И с собой он пусть несёт\n" +
                    "Много счастья, много смеха,\n" +
                    "В жизни и в делах успеха.\n" +
                    "\n" +
                    "Ярких, творческих идей,\n" +
                    "Самых преданных друзей.\n" +
                    "И любви огромной, чистой,\n" +
                    "И улыбок - лишь лучистых!",
            "С Новым годом поздравляю\n" + // БЫЛО; ПРОВ.
                    "И от всей души желаю\n" +
                    "Море счастья, море смеха\n" +
                    "И во всех делах успеха,\n" +
                    "\n" +
                    "Всех желаний исполненья\n" +
                    "И во всём только везенья,\n" +
                    "Крепкого здоровья впрок\n" +
                    "И волшебных дней клубок!",
            "Новый год - весёлый праздник,\n" + // БЫЛО; ПРОВ.
                    "И он должен быть у всех -\n" +
                    "Пусть и в вашем доме милом\n" +
                    "Раздаётся звонкий смех!\n" +
                    "\n" +
                    "Чтобы было настроение\n" +
                    "Веселиться, отмечать\n" +
                    "И подарки из-под ёлки\n" +
                    "с вдохновением открывать!\n" +
                    "\n" +
                    "Чтобы крепкое здоровье,\n" +
                    "Бодрость, счастье и добро\n" +
                    "В этот праздник чтобы было\n" +
                    "И вовеки не ушло!",
            "Вот растаял старый год,\n" + // ПРОВ.
                    "Как снежинка на ладошке.\n" +
                    "Новый год спешит насыпать\n" +
                    "Счастья в каждое окошко.\n" +
                    "\n" +
                    "Пусть он радость принесёт\n" +
                    "Оптимизм, задор, веселье\n" +
                    "И, как жемчуг, соберёт\n" +
                    "Все желанья в ожерелье.\n" +
                    "\n" +
                    "Пусть исполнит всё-всё-всё,\n" +
                    "Что задумывалось вами,\n" +
                    "Жизнь наполнит добротой,\n" +
                    "Волшебством и чудесами!",



            "В жизни чуду есть место всегда,\n" + // БЫЛО; ПРОВ.
                    "И у вас пусть оно приключится.\n" +
                    "Пусть плохое уходит от вас,\n" +
                    "А всё лучшее пусть состоится!\n" +
                    "\n" +
                    "Год пусть будет счастливым для вас,\n" +
                    "Приумножит пускай достижения.\n" +
                    "Ярких дней и сияющих глаз\n" +
                    "В дорогом для души окружении!",
            "Желаю в Новый год добра,\n" + // ПРОВ.
                    "Везения, радости, тепла\n" +
                    "И чтоб у каждого всегда\n" +
                    "Любовь взаимная была.\n" +
                    "\n" +
                    "Пускай сопутствует успех,\n" +
                    "Повсюду слышен будет смех,\n" +
                    "Пусть непременно в Новый год\n" +
                    "Мечты исполнятся у всех!",
            "Желаю в Новый Год, а что желать?\n" + // ПРОВ.
                    "У вас всё есть: и счастье, и всё к счастью.\n" +
                    "Пожалуй, никогда не унывать.\n" +
                    "И жизнь свою в красивый цвет окрасить.\n" +
                    "\n" +
                    "Чтоб этот год был с чистого листа,\n" +
                    "А вы чтоб записали пунктов много.\n" +
                    "Чтоб было всё: любовь и красота,\n" +
                    "Чтоб счастье было здесь, не за порогом.\n" +
                    "\n" +
                    "Чтоб были все цвета, палитра вся\n" +
                    "И кисти, чтобы вдохновение было.\n" +
                    "Чтоб старый год, плохое унося,\n" +
                    "Оставил вам всё то, что сердцу мило.\n" +
                    "\n" +
                    "Чтоб был достаток и уют в дому.\n" +
                    "Ещё здоровья, да, здоровья много!\n" +
                    "Случаться лишь хорошему всему.\n" +
                    "И пусть не будет жизнь к вам слишком строгой.\n" +
                    "\n" +
                    "Пусть балует она почаще вас\n" +
                    "И радостью нечаянной нагрянет,\n" +
                    "Чтоб было всё: и Рига, и Прованс...\n" +
                    "И год для вас успешным очень станет!",
            "Новый год настаёт.\n" + // ПРОВ.
                    "С Новым годом! С новым счастьем!\n" +
                    "Время мчит нас вперёд,\n" +
                    "Старый год уже не властен!\n" +
                    "Пусть кругом всё поёт\n" +
                    "И цветут в улыбках лица,\n" +
                    "Ведь на то и Новый год,\n" +
                    "Чтобы петь и веселиться!",
            "Желаю вам на Новый год,\n" + // ПРОВ.
                    "Пусть тает в вашем сердце лёд,\n" +
                    "Пусть каждый день и каждый час\n" +
                    "Весна в нём майская цветёт!\n" +
                    "\n" +
                    "Заботы в прошлое уйдут,\n" +
                    "Проблемы сами пропадут,\n" +
                    "Здоровье, счастье и любовь\n" +
                    "Вас обязательно найдут!",



            "Новый год такой желанный:\n" + // ПРОВ.
                    "Столько новых перспектив.\n" +
                    "Пусть он будет лёгким, ярким,\n" +
                    "Принесёт добро и мир!\n" +
                    "\n" +
                    "Пусть наполнит судьбы счастьем,\n" +
                    "И здоровьем, и мечтами.\n" +
                    "Пусть любовь вас окружает,\n" +
                    "Пусть родные будут с вами!",
            "Желаю вам я в Новый год,\n" + // БЫЛО; ПРОВ.
                    "Чтоб увеличился доход.\n" +
                    "В жару и в дождь, и в гололёд\n" +
                    "Всегда пусть дома кто-то ждёт.\n" +
                    "\n" +
                    "Друзей, коллег широкий круг,\n" +
                    "И много всяческих заслуг.\n" +
                    "Чтобы отлично вам жилось\n" +
                    "И всё чтоб в жизни удалось!",
            "С ароматом мандаринов\n" + // ПРОВ.
                    "Новый год приходит в дом!\n" +
                    "Пусть у тёплого камина\n" +
                    "Мы подарочки найдём:\n" +
                    "\n" +
                    "Счастье, радость и здоровье,\n" +
                    "Доброту, весёлый смех,\n" +
                    "Мир, уют, тепло с любовью,\n" +
                    "Взлёт в карьере и успех!",
            "С Новым годом поздравляю!\n" + // ПРОВ.
                    "Пусть удачу он приносит,\n" +
                    "Позитив, тепло, внимание,\n" +
                    "Счастья солнечного россыпь.\n" +
                    "\n" +
                    "Пусть родные будут рядом,\n" +
                    "Жизнь успехи умножает,\n" +
                    "Дом всегда уютом манит,\n" +
                    "И карьера процветает!",
            "С Новым годом, с новым счастьем,\n" + // ПРОВ.
                    "С новой радостью, любовью.\n" +
                    "Пусть несёт год вам удачу,\n" +
                    "Смех, улыбки и здоровье.\n" +
                    "\n" +
                    "Нежностью сердца согреет,\n" +
                    "Добротой наполнит души.\n" +
                    "Новый год пусть будет щедрым,\n" +
                    "Самым светлым, самым лучшим!",



            "С Новым годом поздравляю!\n" + // ПРОВ.
                    "Вам желаю целый год\n" +
                    "Быть счастливей всех на свете,\n" +
                    "Не знать горя и хлопот.\n" +
                    "\n" +
                    "Пусть будет новое начало\n" +
                    "Самых важных славных дел.\n" +
                    "Пусть обнимает крепко счастье\n" +
                    "И не знает, где предел.\n" +
                    "\n" +
                    "А ещё я вам желаю\n" +
                    "Много новых перспектив,\n" +
                    "Чтоб без дела не сиделось,\n" +
                    "В каждом дне чтоб был актив.",
            "Пусть Новый год несёт добро,\n" + // ПРОВ.
                    "Любовь, душевное тепло,\n" +
                    "Волшебные мгновения, сказку,\n" +
                    "Здоровье, силы, страсть и ласку.\n" +
                    "\n" +
                    "Пусть все невзгоды заберёт\n" +
                    "С собою уходящий год,\n" +
                    "А впереди пусть ждёт везение,\n" +
                    "Удача, счастье, настроение!",
            "Новый год наступает.\n" + // ПРОВ.
                    "Пусть он счастье подарит,\n" +
                    "Денег даст и здоровья,\n" +
                    "Дом наполнит любовью,\n" +
                    "От тревог пусть избавит\n" +
                    "И страдать не заставит.",
            "От души вас поздравляю\n" + // ПРОВ.
                    "С Новым годом!\n" +
                    "Пусть счастья в доме\n" +
                    "Будет много!\n" +
                    "\n" +
                    "Пусть будет смех,\n" +
                    "Уют, тепло,\n" +
                    "А на душе -\n" +
                    "Приятно и светло!",
            "В сердце пусть живёт любовь,\n" + // ПРОВ.
                    "Огонёк горит надежды.\n" +
                    "Пусвть скажут много добрых слов,\n" +
                    "Тёплых, нежных в этот вечер.\n" +
                    "\n" +
                    "А плохое всё уйдёт,\n" +
                    "Заберёт год уходящий.\n" +
                    "Новый счастье принесёт,\n" +
                    "И пройдёт он весь блестяще!",



            "С Новым годом поздравляю,\n" +
                    "Пусть он счастье принесёт,\n" +
                    "Пусть удача улыбнётся\n" +
                    "И пусть вам весь год везёт.\n" +
                    "\n" +
                    "Засияют пусть на ёлке\n" +
                    "Огоньки светло и ярко,\n" +
                    "В Новый год к вам Дед Мороз\n" +
                    "Пусть придёт с мешком подарков.\n" +
                    "\n" +
                    "В Новый год вам пожелаю\n" +
                    "Счастье я своё найти,\n" +
                    "С нежностью, любовью, лаской\n" +
                    "Пусть вам будет по пути.",
            "Пусть Новый год вам принесёт\n" + // БЫЛО; ПРОВ.
                    "Здоровье и удачу,\n" +
                    "Пусть разрешаются легко\n" +
                    "Все трудные задачи!\n" +
                    "\n" +
                    "Пусть будет радость на душе,\n" +
                    "А в сердце - вдохновенье.\n" +
                    "Побольше веры и любви -\n" +
                    "И прочь уйдут сомненья!\n" +
                    "\n" +
                    "Чтобы хотелось танцевать,\n" +
                    "Любить и быть любимым,\n" +
                    "Благословенным быть во всём\n" +
                    "И Господом хранимым!",
            "Пусть этот славный Новый год\n" + // БЫЛО; ПРОВ.
                    "Подарит счастье и удачу,\n" +
                    "Здоровья много принесёт\n" +
                    "И денег океан в придачу!\n" +
                    "\n" +
                    "Пусть все исполнятся мечты,\n" +
                    "Улыбка пусть сияет ярко!\n" +
                    "Желаю мира, доброты\n" +
                    "И замечательных подарков!",
            "Вот ещё год пролетел,\n" + // ПРОВ.
                    "Оглянуться не успел,\n" +
                    "Снег, зима, декабрь, вот -\n" +
                    "Наступил и Новый год!\n" +
                    "\n" +
                    "С Новым годом поздравляю,\n" +
                    "Счастья, мира пожелаю,\n" +
                    "В жизни новый поворот\n" +
                    "Принесёт пусть Новый год!\n" +
                    "\n" +
                    "Сил, здоровья и терпения,\n" +
                    "И, конечно же, везения;\n" +
                    "Чтобы год прошел прекрасно: \n" +
                    "Чётко, ярко - в общем, классно!"
    };
}